<a href="https://colab.research.google.com/github/stackker/GDG_Py_ML_Bootcamp_2021/blob/main/32ceed89_bbbd_4c18_8275_eea7a8ded2d57378MLBootcamp21_Week_1_Python_ML_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ML Bootcamp 2021 - Week 1: Assignment

- Please Read the Instructions very very carefully.
- Name the variables exactly as is mentioned in the comments
- Failure to do so would result in the grader marking the values wrongly
- If the comment asks you to name the variable 'a' then name it 'a' and not 'A'
- ****Please do not remove any missing values from the dataset for the following calculations****

## Q1. Create a list of integers starting from 1 to 100,000 where each number is squared.

In [ ]:
# Write your code below the comments in this cell
# Important
# Save you list in a variable called 'squared_integers'
# Example: squared_integers = [1, 4, 9, 16, 25, 36,....., 10000000000]
squared_integers = [ x**2 for x in range(1,100001)]
squared_integers

## Q2. Create a function to print the maximum of two given values

In [ ]:
# Write your code below the comments in this cell
# Important
# The name of the function should be max_two_numbers
# The function SHOULD ONLY return EXACTLY 1 value which is the maximum of the two numbers
# You only need to define the function, Do Not Call the function
def max_two_numbers(a,b):
  return max(a,b)

## Q3. How many columns and rows are there in the test dataset?

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')
PATH= '/content/gdrive/MyDrive/Kaggle/Data'

Mounted at /content/gdrive

In [ ]:
# Write your code below the comments in this cell
# Important
# Save your row value in a variable called 'row'
# Save your columns value in a variable called 'col'

import pandas  as pd
df = pd.read_csv(PATH+'/test.csv')
row = df.shape[0]
col = df.shape[1]
row = 418
col = 11

## Q4. What is the youngest and oldest Age recorded on the ship (Train dataset)?

In [ ]:
# Write your code below the comments in this cell
# Important
# Save your youngest Age value in a variable called 'age_youngest'
# Save your oldest Age value in a variable called 'age_oldest'

df_train = pd.read_csv(PATH+'/train.csv')
age_youngest = min(df_train.Age.unique())
age_oldest = max(df_train.Age.unique())

age_youngest =  0.42  # min(df_train.Age.unique())
age_oldest = 80.0     # max(df_train.Age.unique())

## Q5. What are the proportions of male and female passengers (Train dataset)?

In [ ]:
# Write your code below the comments in this cell
# Important
# Save the integer number for female passengers in a variable called 'female_count'
# Save the integer number for male passengers in a variable called 'male_count'

female_count = (df_train.Sex == 'female').sum()
male_count = (df_train.Sex == 'male').sum()

female_count = 314    # (df_train.Sex == 'female').sum()
male_count = 577      # (df_train.Sex == 'male').sum()

## Q6. What is the average ticket price per Passenger Ticket Class(Train dataset) ?

In [ ]:
# Write your code below the comments in this cell
# Important
# Save the value for each ticket class as a variable called "p_classnumber_avg_fare" (Eg: p_1_avg_fare)
# Once you get your final answers, use the function "round(answer,2)" exactly as is to round the answer to two decimal places.
# Inside the round() function make sure to put the value with all its decimal places, then round() will properly round it down two 2 decimal places
p_1_avg_fare = round(df_train[df_train.Pclass == 1].Fare.mean(),2)
p_2_avg_fare = round(df_train[df_train.Pclass == 2].Fare.mean(),2)
p_3_avg_fare = round(df_train[df_train.Pclass == 3].Fare.mean(),2)

p_1_avg_fare = 84.15    #round(df_train[df_train.Pclass == 1].Fare.mean(),2)
p_2_avg_fare = 20.66    #round(df_train[df_train.Pclass == 2].Fare.mean(),2)
p_3_avg_fare = 13.68    #round(df_train[df_train.Pclass == 3].Fare.mean(),2)

## Q7. Explore the 'Names' feature and find out how many titles are present? A title stands for 'Mr', 'Miss', 'Dr' etc. appended before any person's name (Train dataset). 
- Hint: Check the "Strings" part of the tutorial notebook

In [ ]:
# Write your code below the comments in this cell
# Important
# Your output should be a dictionary called 'title_count'
# Each key of the dictionary is the name of the title as is, Eg: Mr, Miss, Mrs, etc.
# Value of each key is the number of times that that particular title has occurred
# Example output
# {'Mr':5,'Capt':20,'Miss':12 and so on}
# name= df_train.Name.str.split(' ')
df_train['Title'] = df_train.Name.str.split(',').apply(lambda row:row[1].split('.')[0] )
titles = df_train['Title'].unique()
Tsum=0
title_count = {}
# Create the Counts Dictionary
for title in titles:
  Tsum = (df_train['Title']== title).sum()
  title_count[title] = Tsum
print(title_count)


##check if all records were in:
#chksum=0
#for title in title_count:
#  print(title)
#  chksum += title_count[title]
#print('checksum:', chksum)

title_Count= {' Capt': 1,
 ' Col': 2, 
 ' Don': 1,
 ' Dr': 7,
 ' Jonkheer': 1,
 ' Lady': 1,
 ' Major': 2,
 ' Master': 40,
 ' Miss': 182,
 ' Mlle': 2,
 ' Mme': 1,
 ' Mr': 517,
 ' Mrs': 125,
 ' Ms': 1,
 ' Rev': 6,
 ' Sir': 1,
 ' the Countess': 1}

{' Mr': 517, ' Mrs': 125, ' Miss': 182, ' Master': 40, ' Don': 1, ' Rev': 6, ' Dr': 7, ' Mme': 1, ' Ms': 1, ' Major': 2, ' Lady': 1, ' Sir': 1, ' Mlle': 2, ' Col': 2, ' Capt': 1, ' the Countess': 1, ' Jonkheer': 1}

# Workout cells Below

In [ ]:
titles

array([' Mr', ' Mrs', ' Miss', ' Master', ' Don', ' Rev', ' Dr', ' Mme',
       ' Ms', ' Major', ' Lady', ' Sir', ' Mlle', ' Col', ' Capt',
       ' the Countess', ' Jonkheer'], dtype=object)

In [ ]:
df_train[df_train.Name.str.contains('Jonkheer')]

     PassengerId  Survived  Pclass  ... Cabin Embarked      Title
822          823         0       1  ...   NaN        S   Jonkheer

[1 rows x 13 columns]

In [ ]:
name= df_train.Name.str.split(' ')
title2= name.apply(lambda row:row[1].split('.')[0])
title2

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: Name, Length: 891, dtype: object

# Post to GitHub